package com.example.viewpager;

import android.content.Intent;
import android.os.Bundle;
import android.support.annotation.NonNull;
import android.support.annotation.Nullable;
import android.support.v4.app.Fragment;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.ListAdapter;
import android.widget.ListView;


import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

public class Fragment1 extends Fragment {

    ArrayList<Item> items = new ArrayList<>();
    ItemAdapter adapter;
    ListView listview;
    View v;

    public Fragment1() {

    }

    @Nullable
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {
        v = LayoutInflater.from(getContext()).inflate(R.layout.fragment1, null);
        final View v = LayoutInflater.from(getContext()).inflate(R.layout.fragment1, null);

        listview = v.findViewById(R.id.listview);
        adapter = new ItemAdapter(items);
        listview.setAdapter(adapter);

        String json = "{\"fields\":[{\"id\":\"휴게소명\"},{\"id\":\"도로종류\"},{\"id\":\"도로노선번호\"},{\"id\":\"도로노선명\"},{\"id\":\"도로노선방향\"},{\"id\":\"위도\"},{\"id\":\"경도\"},{\"id\":\"휴게소종류\"},{\"id\":\"휴게소운영시작시각\"},{\"id\":\"휴게소운영종료시각\"},{\"id\":\"도로점용면적\"},{\"id\":\"주차면수\"},{\"id\":\"경정비가능여부\"},{\"id\":\"주유소유무\"},{\"id\":\"LPG충전소유무\"},{\"id\":\"전기차충전소유무\"},{\"id\":\"버스환승가능여부\"},{\"id\":\"쉼터유무\"},{\"id\":\"화장실유무\"},{\"id\":\"약국유무\"},{\"id\":\"수유실유무\"},{\"id\":\"매점유무\"},{\"id\":\"음식점유무\"},{\"id\":\"기타편의시설\"},{\"id\":\"휴게소대표음식명\"},{\"id\":\"휴게소전화번호\"},{\"id\":\"데이터기준일자\"},{\"id\":\"제공기관코드\"},{\"id\":\"제공기관명\"}],\"records\":[{\"휴게소명\":\"상개화물차휴게소\",\"도로종류\":\"시도\",\"도로노선번호\":\"광3-3\",\"도로노선명\":\"산업로\",\"도로노선방향\":\"상행\",\"위도\":\"35.504483\",\"경도\":\"129.320659\",\"휴게소종류\":\"화물차휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"00:00\",\"도로점용면적\":\"49166\",\"주차면수\":\"271\",\"경정비가능여부\":\"Y\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"기타편의시설\":\"샤워실+세탁실+수면실+세차장+체력단련실\",\"휴게소대표음식명\":\"\",\"휴게소전화번호\":\"052-257-8484\",\"데이터기준일자\":\"2018-08-14\",\"제공기관코드\":\"6310000\",\"제공기관명\":\"울산광역시\"},{\"휴게소명\":\"약수화물차휴게소\",\"도로종류\":\"일반국도\",\"도로노선번호\":\"7호선\",\"도로노선명\":\"산업로\",\"도로노선방향\":\"하행\",\"위도\":\"35.645302\",\"경도\":\"129.342988\",\"휴게소종류\":\"화물차휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"00:00\",\"도로점용면적\":\"41915\",\"주차면수\":\"250\",\"경정비가능여부\":\"Y\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"기타편의시설\":\"샤워실+세탁실+수면실+세차장+체력단련실\",\"휴게소대표음식명\":\"\",\"휴게소전화번호\":\"052-946-2200\",\"데이터기준일자\":\"2018-08-14\",\"제공기관코드\":\"6310000\",\"제공기관명\":\"울산광역시\"},{\"휴게소명\":\"낙동강구미휴게소\",\"도로종류\":\"고속국도\",\"도로노선번호\":\"301번\",\"도로노선명\":\"상주영천고속도로\",\"도로노선방향\":\"상행\",\"위도\":\"36.344493\",\"경도\":\"128.300604\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"24:00\",\"도로점용면적\":\"48338\",\"주차면수\":\"258\",\"경정비가능여부\":\"\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"Y\",\"전기차충전소유무\":\"\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"\",\"화장실유무\":\"Y\",\"약국유무\":\"\",\"수유실유무\":\"Y\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"기타편의시설\":\"\",\"휴게소대표음식명\":\"\",\"휴게소전화번호\":\"054-475-2971\",\"데이터기준일자\":\"2018-06-30\",\"제공기관코드\":\"5080000\",\"제공기관명\":\"경상북도 구미시\"},{\"휴게소명\":\"선산휴게소상지점\",\"도로종류\":\"고속국도\",\"도로노선번호\":\"45번\",\"도로노선명\":\"중부내륙고속도로\",\"도로노선방향\":\"상행\",\"위도\":\"36.277908\",\"경도\":\"128.249304\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"24:00\",\"도로점용면적\":\"28943\",\"주차면수\":\"203\",\"경정비가능여부\":\"N\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"Y\",\"전기차충전소유무\":\"\",\"버스환승가능여부\":\"Y\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"Y\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"기타편의시설\":\"\",\"휴게소대표음식명\":\"\",\"휴게소전화번호\":\"054-482-6011\",\"데이터기준일자\":\"2018-06-30\",\"제공기관코드\":\"5080000\",\"제공기관명\":\"경상북도 구미시\"},{\"휴게소명\":\"선산휴게소하지점\",\"도로종류\":\"고속국도\",\"도로노선번호\":\"45번\",\"도로노선명\":\"중부내륙고속도로\",\"도로노선방향\":\"하행\",\"위도\":\"36.274211\",\"경도\":\"128.250738\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"24:00\",\"도로점용면적\":\"32460\",\"주차면수\":\"260\",\"경정비가능여부\":\"N\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"Y\",\"전기차충전소유무\":\"\",\"버스환승가능여부\":\"Y\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"Y\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"기타편의시설\":\"\",\"휴게소대표음식명\":\"\",\"휴게소전화번호\":\"054-482-6031\",\"데이터기준일자\":\"2018-06-30\",\"제공기관코드\":\"5080000\",\"제공기관명\":\"경상북도 구미시\"},{\"휴게소명\":\"영덕휴게소\",\"도로종류\":\"일반국도\",\"도로노선번호\":\"7번\",\"도로노선명\":\"일반국도7호선\",\"도로노선방향\":\"상행\",\"위도\":\"36.528948\",\"경도\":\"129.403459\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"07:00\",\"휴게소운영종료시각\":\"22:00\",\"도로점용면적\":\"18000\",\"주차면수\":\"150\",\"경정비가능여부\":\"N\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"휴게소대표음식명\":\"육개장\",\"휴게소전화번호\":\"054-734-5980\",\"데이터기준일자\":\"2018-08-30\",\"제공기관코드\":\"5180000\",\"제공기관명\":\"경상북도 영덕군\"},{\"휴게소명\":\"병곡휴게소\",\"도로종류\":\"일반국도\",\"도로노선번호\":\"7번\",\"도로노선명\":\"일반국도7호선\",\"도로노선방향\":\"상행\",\"위도\":\"36.606818\",\"경도\":\"129.413634\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"07:00\",\"휴게소운영종료시각\":\"20:00\",\"도로점용면적\":\"5000\",\"주차면수\":\"80\",\"경정비가능여부\":\"N\",\"주유소유무\":\"N\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"휴게소대표음식명\":\"정식\",\"휴게소전화번호\":\"054-732-2484\",\"데이터기준일자\":\"2018-08-30\",\"제공기관코드\":\"5180000\",\"제공기관명\":\"경상북도 영덕군\"},{\"휴게소명\":\"칠보산휴게소\",\"도로종류\":\"일반국도\",\"도로노선번호\":\"7번\",\"도로노선명\":\"일반국도7호선\",\"도로노선방향\":\"하행\",\"위도\":\"36.632392\",\"경도\":\"129.416259\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"07:00\",\"휴게소운영종료시각\":\"22:00\",\"도로점용면적\":\"6000\",\"주차면수\":\"120\",\"경정비가능여부\":\"N\",\"주유소유무\":\"N\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"휴게소대표음식명\":\"부페\",\"휴게소전화번호\":\"054-734-5801\",\"데이터기준일자\":\"2018-08-30\",\"제공기관코드\":\"5180000\",\"제공기관명\":\"경상북도 영덕군\"},{\"휴게소명\":\"여수화물자동차휴게소\",\"도로종류\":\"시도\",\"도로노선번호\":\"대로1-4\",\"도로노선명\":\"도시계획도로\",\"위도\":\"34.797906\",\"경도\":\"127.662228\",\"휴게소종류\":\"화물차휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"24:00\",\"도로점용면적\":\"0\",\"주차면수\":\"396\",\"경정비가능여부\":\"Y\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"Y\",\"전기차충전소유무\":\"Y\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"기타편의시설\":\"Y\",\"휴게소대표음식명\":\"N\",\"휴게소전화번호\":\"061-692-9678\",\"데이터기준일자\":\"2019-03-01\",\"제공기관코드\":\"4810000\",\"제공기관명\":\"전라남도 여수시\"},{\"휴게소명\":\"시화나래휴게소\",\"도로종류\":\"지방도\",\"도로노선번호\":\"301\",\"도로노선명\":\"대부황금로\",\"도로노선방향\":\"양방향\",\"위도\":\"32.573926\",\"경도\":\"124.8702778\",\"휴게소종류\":\"간이휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"23:59\",\"도로점용면적\":\"76809\",\"주차면수\":\"450\",\"경정비가능여부\":\"N\",\"주유소유무\":\"N\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"Y\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"N\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"Y\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"기타편의시설\":\"ATM\",\"휴게소대표음식명\":\"돈까스\",\"휴게소전화번호\":\"032-880-7000\",\"데이터기준일자\":\"2019-01-30\",\"제공기관코드\":\"3930000\",\"제공기관명\":\"경기도 안산시\"},{\"휴게소명\":\"시화나래조력문화관 달전망대\",\"도로종류\":\"지방도\",\"도로노선번호\":\"301\",\"도로노선명\":\"대부황금로\",\"도로노선방향\":\"양방향\",\"위도\":\"37.312897\",\"경도\":\"126.609219\",\"휴게소종류\":\"간이휴게소\",\"휴게소운영시작시각\":\"10:00\",\"휴게소운영종료시각\":\"22:00\",\"도로점용면적\":\"932.99\",\"주차면수\":\"0\",\"경정비가능여부\":\"N\",\"주유소유무\":\"N\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"N\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"N\",\"음식점유무\":\"Y\",\"휴게소대표음식명\":\"스테이크+수제버거+커피\",\"휴게소전화번호\":\"032-889-3365\",\"데이터기준일자\":\"2019-01-30\",\"제공기관코드\":\"3930000\",\"제공기관명\":\"경기도 안산시\"},{\"휴게소명\":\"단양(춘천방향)휴게소\",\"도로종류\":\"고속국도\",\"도로노선번호\":\"55\",\"도로노선명\":\"중앙선\",\"위도\":\"36.939341\",\"경도\":\"128.320788\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"23:59\",\"도로점용면적\":\"79980\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"Y\",\"전기차충전소유무\":\"Y\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"휴게소대표음식명\":\"수제등심돈가스\",\"휴게소전화번호\":\"043-421-1671\",\"데이터기준일자\":\"2019-04-20\",\"제공기관코드\":\"4480000\",\"제공기관명\":\"충청북도 단양군\"},{\"휴게소명\":\"단양(부산방향)휴게소\",\"도로종류\":\"고속국도\",\"도로노선번호\":\"55\",\"도로노선명\":\"중앙선\",\"위도\":\"36.995355\",\"경도\":\"128.287598\",\"휴게소종류\":\"일반휴게소\",\"휴게소운영시작시각\":\"00:00\",\"휴게소운영종료시각\":\"23:59\",\"도로점용면적\":\"31481\",\"주유소유무\":\"Y\",\"LPG충전소유무\":\"Y\",\"전기차충전소유무\":\"Y\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"매점유무\":\"Y\",\"음식점유무\":\"Y\",\"휴게소대표음식명\":\"단양마늘약초갈비탕\",\"휴게소전화번호\":\"043-423-5403\",\"데이터기준일자\":\"2019-04-20\",\"제공기관코드\":\"4480000\",\"제공기관명\":\"충청북도 단양군\"},{\"휴게소명\":\"옥거쉼터\",\"도로종류\":\"지방도\",\"도로노선번호\":\"795\",\"도로노선명\":\"진용로\",\"위도\":\"35.943484\",\"경도\":\"127.494575\",\"휴게소종류\":\"간이휴게소\",\"휴게소운영시작시각\":\"09:00\",\"휴게소운영종료시각\":\"20:00\",\"도로점용면적\":\"10\",\"경정비가능여부\":\"N\",\"주유소유무\":\"N\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"N\",\"음식점유무\":\"N\",\"휴게소전화번호\":\"063-430-8711\",\"데이터기준일자\":\"2018-08-24\",\"제공기관코드\":\"4730000\",\"제공기관명\":\"전라북도 진안군\"},{\"휴게소명\":\"와룡쉼터\",\"도로종류\":\"군도\",\"도로노선번호\":\"22\",\"도로노선명\":\"주용로\",\"위도\":\"35.953011\",\"경도\":\"127.466423\",\"휴게소종류\":\"간이휴게소\",\"휴게소운영시작시각\":\"09:00\",\"휴게소운영종료시각\":\"20:00\",\"도로점용면적\":\"20\",\"경정비가능여부\":\"N\",\"주유소유무\":\"N\",\"LPG충전소유무\":\"N\",\"전기차충전소유무\":\"N\",\"버스환승가능여부\":\"N\",\"쉼터유무\":\"Y\",\"화장실유무\":\"Y\",\"약국유무\":\"N\",\"수유실유무\":\"N\",\"매점유무\":\"N\",\"음식점유무\":\"N\",\"휴게소전화번호\":\"063-430-8711\",\"데이터기준일자\":\"2018-08-24\",\"제공기관코드\":\"4730000\",\"제공기관명\":\"전라북도 진안군\"}]}";

        try {
            JSONObject jsonobject = new JSONObject(json);
            String name = jsonobject.getString("records");
            JSONArray jsonarray = new JSONArray(name);
            System.out.println(jsonarray.length());
            HashMap<String, String> highwaylist = new HashMap<>();
            for (int i = 0; i < jsonarray.length(); i++) {
                JSONObject subJsonObject = jsonarray.getJSONObject(i);
                String highwayname = subJsonObject.getString("도로노선명");
                String highwaynum = subJsonObject.getString("도로노선번호");
                String rest = subJsonObject.getString("쉼터유무");

                if (!highwaylist.containsKey(highwayname)) {
                    highwaylist.put(highwayname, highwaynum);
                    items.add(new Item(highwayname, highwaynum + " | 쉼터유무 : " + rest));
                    if (!highwaylist.containsKey(highwayname)) {
                        highwaylist.put(highwayname, highwaynum);
                        items.add(new Item(highwayname, highwaynum));
                    }
                }
            }

            } catch(JSONException e){
                e.printStackTrace();
            }

        listview.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                Intent intent = new Intent(v.getContext(), Detail_activity.class);
                intent.putExtra("title", items.get(position).getTitle());
                intent.putExtra("subtitle", items.get(position).getSubtitle());
                startActivity(intent);
            }
        });

        return v;
    }
}
